In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
#Q1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [7]:
def func():
    arr = np.array([10,20,30,40,50])
    arr = pd.Series(arr)
    print(arr)

func()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
#Q2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [9]:
def func2():
    series = pd.Series([10,20,30,40,50])
    arr = np.array(series)
    print(arr)
    print(f"type : {type(arr)}")

func2()

[10 20 30 40 50]
type : <class 'numpy.ndarray'>

In [10]:
#Q3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
#   Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [11]:
def func3():
    s1 = pd.Series([2,4,6,8,10])
    s2 = pd.Series([1,3,5,7,9])
    print(f"addition : ")
    print(s1+s2)
    print(f"substraction : ")
    print(s1-s2)
    print(f"multiplication : ")
    print(s1*s2)
    print(f"division : ")
    print(s1/s2)
func3()

addition :
0     3
1     7
2    11
3    15
4    19
dtype: int64
substraction :
0    1
1    1
2    1
3    1
4    1
dtype: int64
multiplication :
0     2
1    12
2    30
3    56
4    90
dtype: int64
division :
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [12]:
#Q4. Write a Pandas program to convert a dictionary to a Pandas series.

In [13]:
def func4():
    d = {
        "raj":123,
        "akash" : 456,
        "jay" : 789
        }
    s1 = pd.Series(d)
    print(s1)

func4()

raj      123
akash    456
jay      789
dtype: int64

In [14]:
#Q5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [15]:
def func5():
    arr = np.array([10,20,30,40,50])
    s1 = pd.Series(arr)
    print (s1)

func5()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [16]:
#Q6. Write a Pandas program to change the data type of given a column or a Series.

In [17]:
def func6():
    s1 = pd.Series(['10','20','30','40','50'])
    print(f"datatype : {s1.dtype}")
    s2 = pd.to_numeric(s1)
    print(f"after changing datatype : {s2.dtype}")

func6()

datatype : object
after changing datatype : int64

In [18]:
#Q7. Write a Pandas program to convert a given Series to an array.

In [19]:
def func7():
    s1 = pd.Series([10,20,30,40,50])
    print(f"series : {s1}")
    arr = np.array(s1)
    print(f"array : {arr}")

func7()

series : 0    10
1    20
2    30
3    40
4    50
dtype: int64
array : [10 20 30 40 50]

In [20]:
#Q8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [21]:
def func8():
    d = {
        "raj":123,
        "akash" : 456,
        "jay" : 789
        }
    d = pd.Series(d)
    df = pd.DataFrame(d)
    print(df)

func8()

         0
raj    123
akash  456
jay    789

In [65]:
#Q9

In [42]:
def func9():
    emp = ["raj","akash","hitesh","jay","shubham","parth","ashay","upal","parekh","jenish"]
    emp_id = [1,2,3,4,5,6,7,8,9,10]
    # print(emp)
    # print(emp_id)
    s_emp_id = pd.Series(emp_id)
    s_emp = pd.Series(emp)
    print(s_emp)
    #print(s_emp_id)
    d1 = pd.DataFrame({'emp_id':s_emp_id,'name':s_emp})
    print("All record:")
    print(d1)
    d1.head()
    d1.tail()
    d1.head(2)
    d1.tail(2)
    d1.to_csv('MyRecord.csv')

func9()

0        raj
1      akash
2     hitesh
3        jay
4    shubham
5      parth
6      ashay
7       upal
8     parekh
9     jenish
dtype: object
All record:
   emp_id     name
0       1      raj
1       2    akash
2       3   hitesh
3       4      jay
4       5  shubham
5       6    parth
6       7    ashay
7       8     upal
8       9   parekh
9      10   jenish

In [43]:
#Q10

In [44]:
df = pd.read_csv('./MyRecord.csv')

In [48]:
df['salary'] = df['emp_id']
print(df)

   Unnamed: 0  emp_id     name  salary
0           0       1      raj       1
1           1       2    akash       2
2           2       3   hitesh       3
3           3       4      jay       4
4           4       5  shubham       5
5           5       6    parth       6
6           6       7    ashay       7
7           7       8     upal       8
8           8       9   parekh       9
9           9      10   jenish      10

In [49]:
#Q12

In [51]:
df = pd.read_csv('./Salary_Data.csv')

In [52]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [53]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [54]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [56]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [59]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [61]:
df.shape

(33, 2)

In [62]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [71]:
print((df.columns.dtype))

object

In [72]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000